КАКерамика_моя_старая_база/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияТиповые_УФ_УТ/Module.bsl
#Область ДанныеДляТОРГ12

Функция МассаБрутто(СтрокаТЧТовары) Экспорт

	ВерсияКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.Контур_РазобратьВерсиюСтрокой(Метаданные.Версия);
	
	КонстантыЕдиницаИзмеренияВеса = Константы.ЕдиницаИзмеренияВеса.Получить();
	
	// Для УТ 11.0 и 11.1
	Если ВерсияКонфигурации.Младшая = 0 Или ВерсияКонфигурации.Младшая = 1 Тогда
		
		Если ЗначениеЗаполнено(КонстантыЕдиницаИзмеренияВеса) Тогда
		
			Если ЗначениеЗаполнено(СтрокаТЧТовары.Упаковка) Тогда
				МассаБрутто = СтрокаТЧТовары.КоличествоУпаковок * СтрокаТЧТовары.Упаковка.Вес;	
			Иначе			
				МассаБрутто = СтрокаТЧТовары.Количество * СтрокаТЧТовары.Номенклатура.Вес;
			КонецЕсли;			
			
		Иначе           
			МассаБрутто = 0;
		КонецЕсли;
		
		Возврат МассаБрутто;
		
	КонецЕсли;
	
	ТаблицаНоменклатураСУпаковокой = Новый ТаблицаЗначений;
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	НоваяСтрока = ТаблицаНоменклатураСУпаковокой.Добавить();
	НоваяСтрока.Номенклатура = СтрокаТЧТовары.Номенклатура;
	НоваяСтрока.Упаковка = СтрокаТЧТовары.Упаковка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатураСУпаковокой.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатураСУпаковокой.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&ТаблицаНоменклатураСУпаковокой КАК ТаблицаНоменклатураСУпаковокой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ		
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Упаковка КАК Упаковка,
		|	&ТекстЗапросаВесУпаковки КАК ВесУпаковки
		|ИЗ
		|	ТаблицаТоваров КАК ТаблицаТоваров";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаВесУпаковки",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
				"ТаблицаТоваров.Упаковка",
				"ТаблицаТоваров.Номенклатура"));
		
	Запрос.Параметры.Вставить("ТаблицаНоменклатураСУпаковокой", ТаблицаНоменклатураСУпаковокой);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ВесУпаковки = РезультатЗапроса[0].ВесУпаковки;

	Если ЗначениеЗаполнено(КонстантыЕдиницаИзмеренияВеса) Тогда
		
		Если ЗначениеЗаполнено(СтрокаТЧТовары.Упаковка) Тогда
			Если СтрокаТЧТовары.Упаковка.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Вес Тогда
				Количество = СтрокаТЧТовары.Количество;
			Иначе
				Количество = СтрокаТЧТовары.КоличествоУпаковок;
			КонецЕсли;
		Иначе			
			Количество = СтрокаТЧТовары.Количество;
		КонецЕсли;
					
		МассаБрутто = ВесУпаковки * Количество;
		
	Иначе
		МассаБрутто = 0;
	КонецЕсли;

	Возврат МассаБрутто;
	
КонецФункции

Функция КоличествоМест(СтрокаТЧТовары) Экспорт
	
	ВерсияКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.Контур_РазобратьВерсиюСтрокой(Метаданные.Версия);
	
	МодульПродажиСервер = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("ПродажиСервер");
	Если МодульПродажиСервер = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	// Для УТ 11.0 и 11.1
	Если ВерсияКонфигурации.Младшая = 0 Или ВерсияКонфигурации.Младшая = 1 Тогда
		
		ТаблицаНоменклатураСУпаковокой = Новый ТаблицаЗначений;
		ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));
		ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
		ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
		ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка"));
		
		НоваяСтрока = ТаблицаНоменклатураСУпаковокой.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧТовары.Номенклатура;
		НоваяСтрока.Упаковка = СтрокаТЧТовары.Упаковка;
		НоваяСтрока.Количество = СтрокаТЧТовары.Количество;
		НоваяСтрока.КоличествоУпаковок = СтрокаТЧТовары.КоличествоУпаковок;
		НоваяСтрока.НомерСтроки = СтрокаТЧТовары.НомерСтроки;	
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаНоменклатураСУпаковокой.Номенклатура КАК Номенклатура,
			|	ТаблицаНоменклатураСУпаковокой.Упаковка КАК Упаковка,
			|	ТаблицаНоменклатураСУпаковокой.Количество КАК Количество,
			|	ТаблицаНоменклатураСУпаковокой.КоличествоУпаковок КАК КоличествоУпаковок,
			|	ТаблицаНоменклатураСУпаковокой.НомерСтроки КАК НомерСтроки,
			|	"""" КАК Ссылка,
			|	ЛОЖЬ КАК ЭтоНабор
			|ПОМЕСТИТЬ РеализацияТоваровУслугТаблицаТоваров
			|ИЗ
			|	&ТаблицаНоменклатураСУпаковокой КАК ТаблицаНоменклатураСУпаковокой";
		
		Запрос.Параметры.Вставить("ТаблицаНоменклатураСУпаковокой", ТаблицаНоменклатураСУпаковокой);
		
		Запрос.Выполнить();
		
		МодульПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц, "РеализацияТоваровУслугТаблицаТоваров");
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &ВыводитьБазовыеЕдиницыИзмерения ИЛИ ТаблицаТоваров.ЭтоНабор
		|			ТОГДА ТаблицаТоваров.КоличествоУпаковок
		|		ИНАЧЕ КоэффициентыУпаковок.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
		|	КОНЕЦ КАК КоличествоМест
		|ИЗ
		|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
		|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
		|			И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
		|			И НЕ &ВыводитьБазовыеЕдиницыИзмерения";
		
		Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() > 0 Тогда
			Возврат Результат[0].КоличествоМест;
		Иначе
			Возврат 0;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаНоменклатураСУпаковокой = Новый ТаблицаЗначений;
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатураСУпаковокой.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка"));
	
	НоваяСтрока = ТаблицаНоменклатураСУпаковокой.Добавить();
	НоваяСтрока.Номенклатура = СтрокаТЧТовары.Номенклатура;
	НоваяСтрока.Упаковка = СтрокаТЧТовары.Упаковка;
	НоваяСтрока.Количество = СтрокаТЧТовары.Количество;
	НоваяСтрока.КоличествоУпаковок = СтрокаТЧТовары.КоличествоУпаковок;
	НоваяСтрока.НомерСтроки = СтрокаТЧТовары.НомерСтроки;	
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаНоменклатураСУпаковокой.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатураСУпаковокой.Упаковка КАК Упаковка,
		|	ТаблицаНоменклатураСУпаковокой.Количество КАК Количество,
		|	ТаблицаНоменклатураСУпаковокой.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТаблицаНоменклатураСУпаковокой.НомерСтроки КАК НомерСтроки,
		|	"""" КАК Ссылка,
		|	ЛОЖЬ КАК ЭтоНабор
		|ПОМЕСТИТЬ РеализацияТоваровУслугТаблицаТоваров
		|ИЗ
		|	&ТаблицаНоменклатураСУпаковокой КАК ТаблицаНоменклатураСУпаковокой";
	
	Запрос.Параметры.Вставить("ТаблицаНоменклатураСУпаковокой", ТаблицаНоменклатураСУпаковокой);
	
	Запрос.Выполнить();
	
	МодульПродажиСервер.ПоместитьВременнуюТаблицуКоэффициентыУпаковок(МенеджерВременныхТаблиц, "РеализацияТоваровУслугТаблицаТоваров");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ &ВыводитьБазовыеЕдиницыИзмерения
		|		И НЕ ТаблицаТоваров.ЭтоНабор
		|			ТОГДА ВЫБОР
		|				КОГДА КоэффициентыУпаковок.Количество < КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
		|				ИЛИ ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
		|				И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
		|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
		|				ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
		|				И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
		|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
		|				ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
		|				И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
		|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
		|				ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
		|				И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
		|				И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
		|					ТОГДА КоэффициентыУпаковок.КоличествоУпаковок
		|				ИНАЧЕ ТаблицаТоваров.Количество / КоэффициентыУпаковок.КоэффициентВложеннойУпаковки
		|			КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ТаблицаТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			И &ВыводитьБазовыеЕдиницыИзмерения
		|			И ((ТаблицаТоваров.Номенклатура.ВесИспользовать
		|			И ТаблицаТоваров.Номенклатура.ВесМожноУказыватьВДокументах
		|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ВесЕдиницаИзмерения)
		|			ИЛИ (ТаблицаТоваров.Номенклатура.ОбъемИспользовать
		|			И ТаблицаТоваров.Номенклатура.ОбъемМожноУказыватьВДокументах
		|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ОбъемЕдиницаИзмерения)
		|			ИЛИ (ТаблицаТоваров.Номенклатура.ДлинаИспользовать
		|			И ТаблицаТоваров.Номенклатура.ДлинаМожноУказыватьВДокументах
		|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ДлинаЕдиницаИзмерения)
		|			ИЛИ (ТаблицаТоваров.Номенклатура.ПлощадьИспользовать
		|			И ТаблицаТоваров.Номенклатура.ПлощадьМожноУказыватьВДокументах
		|			И ТаблицаТоваров.Упаковка = ТаблицаТоваров.Номенклатура.ПлощадьЕдиницаИзмерения))
		|				ТОГДА ТаблицаТоваров.КоличествоУпаковок
		|			КОГДА ТаблицаТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ИЛИ ТаблицаТоваров.Упаковка = (ВЫБОР
		|				КОГДА &ВыводитьБазовыеЕдиницыИзмерения
		|					ТОГДА ТаблицаТоваров.Номенклатура.ЕдиницаИзмерения
		|				ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
		|			КОНЕЦ)
		|				ТОГДА ТаблицаТоваров.Количество
		|			ИНАЧЕ ТаблицаТоваров.Количество / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
		|		КОНЕЦ
		|	КОНЕЦ КАК КоличествоМестДробное
		|ПОМЕСТИТЬ РасчитанныеДанныеУпаковокЕдиницИзмерения
		|ИЗ
		|	РеализацияТоваровУслугТаблицаТоваров КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыУпаковок КАК КоэффициентыУпаковок
		|		ПО ТаблицаТоваров.Ссылка = КоэффициентыУпаковок.Ссылка
		|		И ТаблицаТоваров.НомерСтроки = КоэффициентыУпаковок.НомерСтроки
		|		И ТаблицаТоваров.Номенклатура = КоэффициентыУпаковок.Номенклатура
		|		И ТаблицаТоваров.КоличествоУпаковок = КоэффициентыУпаковок.КоличествоУпаковок
		|		И (НЕ &ВыводитьБазовыеЕдиницыИзмерения)
		|;
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДанныеУпаковок.КоличествоМестДробное = (ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное КАК ЧИСЛО(12, 0)))
		|			ТОГДА ДанныеУпаковок.КоличествоМестДробное
		|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУпаковок.КоличествоМестДробное + 0.5 КАК ЧИСЛО(12, 0))
		|	КОНЕЦ КАК КоличествоМест
		|ИЗ
		|	РасчитанныеДанныеУпаковокЕдиницИзмерения КАК ДанныеУпаковок";
	
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаЕдиницаИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));
		
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].КоличествоМест;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаТоварыДляТОРГ12(Основание) Экспорт
	
	тзТовары = Новый ТаблицаЗначений;
	
	ВерсияКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.Контур_РазобратьВерсиюСтрокой(Метаданные.Версия);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		МассивОбъектов = Новый Массив;
		Для каждого СтрокаДокументОснование Из Основание.ДокументыОснования Цикл
			МассивОбъектов.Добавить(СтрокаДокументОснование.ДокументОснование);
		КонецЦикла;
	Иначе
		МассивОбъектов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Основание);
	КонецЕсли;
	
	МодульОбщегоНазначенияУТ = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("ОбщегоНазначенияУТ");
	Если МодульОбщегоНазначенияУТ = Неопределено Тогда
		Возврат тзТовары;
	КонецЕсли;
	
	МодульОбщегоНазначения = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("ОбщегоНазначения");
	Если МодульОбщегоНазначения = Неопределено Тогда
		Возврат тзТовары;
	КонецЕсли;
	
	СтруктураТипов = МодульОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ВыводитьУслуги", Истина);
	
	инд = 1;
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		Если ВерсияКонфигурации.Младшая = 1
			Или ВерсияКонфигурации.Младшая = 2
			Или ВерсияКонфигурации.Младшая = 3
			Или ВерсияКонфигурации.Младшая = 4 Тогда
			
			МенеджерОбъекта = МодульОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
			
		Иначе
			
			МенеджерОбъекта = МодульОбщегоНазначенияУТ.ПолучитьМодульЛокализации(СтруктураОбъектов.Ключ);
			Если МенеджерОбъекта = Неопределено Тогда
				МенеджерОбъекта = МодульОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыТОРГ12(ПараметрыПечати, СтруктураОбъектов.Значение);
		Исключение
			Возврат тзТовары;
		КонецПопытки;
		
		тзРезультатПоТабличнойЧасти = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выгрузить();
		
		Если инд = 1 Тогда
			тзТовары = тзРезультатПоТабличнойЧасти.Скопировать();
		Иначе
			Для каждого СтрокаТовары Из тзРезультатПоТабличнойЧасти Цикл 
				ЗаполнитьЗначенияСвойств(тзТовары.Добавить(), СтрокаТовары) 
			КонецЦикла; 
		КонецЕсли;
		
		инд = инд + 1;
		
	КонецЦикла;
	
	Возврат тзТовары;
	
КонецФункции

Функция ЗначениеРеквизитаТЧТоварыДляТОРГ12(ТаблицаТовары, ИмяРеквизита, Основание, ДокументОснование) Экспорт
	
	НайдСтроки = ТаблицаТовары.НайтиСтроки(Новый Структура("Ссылка, НомерСтроки", ДокументОснование, Основание.НомерСтроки));
	
	Если НайдСтроки.Количество() > 0 Тогда
		
		Возврат НайдСтроки[0][ИмяРеквизита];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
